[{"content": ["为什么要建安全天下事（全本）", " ", "      2007年8月程序员改版开设天下事栏目，作为一个安全工作者，很高兴看到安全技术和产业被重视，安全天下事占据了一个版面。", " ", "      这个栏目基本上是由我主持的，想来本人一向懈怠懒散，每期往往都是编辑多次催促的结果，回想起来也深感不安。", " ", "      几年间对口的编辑老师换了几位，但我还霸占这个栏目，有时感觉有些惭愧，而我还不免有些狂悖，曾经为删去的一两句话而兴师问罪。", " 因为篇幅的原因，本人言辞琐碎、以及某些人所共知或者人所不知的原因，刊载出来的内容往往比我的原稿少那么一两句、或者一两段的话，本身是很正常的。但我还曾因此发作，实属不该，所以决心利用博客的形式搞了这个安全天下事全本、再不对编辑老师为难。", " ", "      把每期整理起来，看到目前已经完成的30余期小短文，有点想不到竟是我这等散漫之徒所为，这一点也要感谢《程序员》给我每月一个固定的提醒，这甚至比安天的管理例会都要精确。尽管这些文字对读者裨益菲薄，也和程序员的底蕴未必相称，但对我个人来说，每个月的安全天下事都是一个时间的刻度、每一年的安全天下事也都成了我这个信息安全老兵的一圈年轮。", " ", "      从稚嫩到成熟、从成熟到老去，这是一个规律，我希望看到一个真正能俯瞰八方的安全才俊来主持，我尽快由一个原创者变成一个转载者，更希望天下事栏目能够在程序员杂志长存，一直是中国的软件工程师们看世界万千的一扇西窗。", " ", "++++++++++++", "预计在12月13日重新校对整理完此前各期，当天张贴完毕。", " ", "原则上每月5日更新当月内容。", " ", " ", " "], "tag": ["工作"], "user": ["antiy_seak"], "title": ["\r\n        为什么要建安全天下事（全本）\r\n        "]},
{"content": [" ", "（2007年08月）文/江海客", " ", "      我真的不知道一个安全栏该如何开篇，因为我心中对安全二字同样充满了恐惧。1994年，一个兄弟发现教研室机器有病毒，祭出debug数分钟轻松搞定，上周作为一名资深驱动程序员的他，喃喃地打电话给我，无限羞赧地说：“我家里感染了一个流氓软件，花了1个多小时没搞定。”1997年，一个兄弟无比热心地一次次在网上对电子邮件病毒的传言进行反驳和澄清，而昨天他打电话给我，让我警惕一个新的某电子邮件客户端溢出漏洞。2003年，一个兄弟听说有人每天战战兢兢，只敢用一个无IP Linux中安装一个Windows虚拟机上网，大声嘲笑人家变态；今天，我突然看到他自己的机器装了一个Ubuntu，然后正在用里面的vmware上网。", "      他们都是我的同行，这些年我们一直在努力，我们一直在前行，但我们越来越恐惧。是我们老了，所以害怕了？还是我们的信息世界，完全无视我们这些以职业信息安全工作者自居的人存在，以及我们没日没夜的努力，依然狂放的走向危机四伏。", "      当号称比Windows的开发者们还懂Windows底层的大师级人物Mark Russinovich突然在自己机器上发现了rootkit；当圈内有名的rootkit研究的高手，波兰美女Joanna Rutkowska觉得就算自己被其他攻击者搞定也属于正常；你就会发现一旦信息安全体系彻底崩盘，覆巢之下，岂有完卵。", "      曾与国家反入侵与防病毒研究中心的胡永涛副研究员等专家闲聊，最后大家结论十分悲观，再这样下去，以后发现系统被入侵后，重装系统已经不够，夸张点说可能需要重新买机器。因为无论是BIOS和网卡的BootROM都是可以软写的，可能已经被放入了后门。不过，买来的新机器也要好好看看，BlackHat上已经有人实现了PCI的rootkit。", "      本月也有不止一个的同行，在聊天中抱怨他们的压力，怕出安全事故、怕自己的机器被渗透、怕安全产品解决不了问题、怕查杀流氓软件之后遭到起诉、怕误杀正常文件给用户带来麻烦。但有什么办法呢？这本来就是一个如临深渊、如覆薄冰的领域，无为可能是一种无知，而恐惧才是常态。", "      写到这里，突然想起了我的同事李柏松的一句语录“不懂网络安全的人是幸福的人，而我们的责任就是保卫他们的幸福。”"], "tag": ["windows", "vmware", "电话", "ubuntu", "虚拟机", "linux"], "user": ["antiy_seak"], "title": ["\r\n        2007年08月《安全天下事》\r\n        "]},
{"content": [" ", "发散的安全焦点——2012年8月安全天下事", " ", " ", "国内非常有特色的安全焦点系列会议xKungFoo和XCon八月在北京召开。安全界普遍认为xKungFoo是开场锣鼓，而XCon才是正会。以往XCon的亮点议题基本云集于漏洞挖掘领域（而多数参会者也是为了在这方面取经而来），本届议题则非常发散，尽管攻击和防御依然是主旋律，但也多了取证、安全测试等方面的议题。", "如果从议题的分布来看，国内的议题多半在传统领域，如Web安全、网银安全等；国外的同行们则带来了更多新领域的话题，如Paul Craig的《攻击图形化的受限操作环境》（并在会议上发布了新的工具）、Stefan Esser的《iOS内核堆利用战场》等。", "微软的褚诚云带来了《Windows8上安全对抗技术的提升》，他介绍了在Win8上代码编译、ASLR、堆和内核保护等方面新的安全措施。微软在安全方面的持续投入和长期战略，看起来正在不断结出果实。", "iOS也注定会是一个热点，除了Stefan Esser，Andrey Belenko还带来了《iOS数据保护的进化和iPhone取证》的议题，这个议题覆盖了从iOS早期版本到iOS 5的数据加密策略的整个变迁。", "   安天实验室两位从事硬件安全研究的博士Esoul和TB，在会上带来一个通过长波信号干扰原理改变电波钟和电波表的时间的演示。这个演示的原理并不复杂，但确实是过去的研究者罕有涉猎的一个点。我给这个报告打了8分，扣两分是因为演示之前的背景介绍环节过于冗长。", "   国内老牌研究者的王伟的《负责任的安全漏洞披露》这个议题引发了同行的争鸣。关于漏洞的“No more free bugs”到底是不是正途的问题，预计还将讨论下去。但国内的研究者从经验、到方法论、到产业责任的思考，却让我们看到一种宏观和成熟。", "Jeffery Moss进行了本次的压轴演讲。他是ICANN副总裁兼首席安全官，BlackHat（全球技术性安全会议）和DEFCon（黑客大会）的创始人，美国国土安全咨询委员会顾问。而他报告的题目也具有一种辩证感Why I don't trust anything（“为什么我什么都不信”）。他列举了从ARPANET到移动网络、从软件到硬件、从互联网基础设施到智能终端这些方面从早期直到当前出现的种种安全问题，再次提醒大家目前安全威胁的广泛性和严重性。", "抛开其具体内容不谈，质疑一直是黑客精神的基本基因之一。", "值得一提的是，本次会议的赞助者除了启明星辰和绿盟这两家老牌的独立安全厂商外，多了腾讯的身影，因此抽奖的奖品也变成了身着盔甲的企鹅。互联网巨头在安全界的布局可谓无孔不入。", " ", " ", " "], "tag": ["ios", "智能终端", "互联网", "微软", "bugs", "windows"], "user": ["antiy_seak"], "title": ["\r\n        2012年8月 发散的安全焦点\r\n        "]},
{"content": ["罗生门——", "年", "月安全天下事", "对事件的细节进行了如下说明：", "公布了", "多万个", "及对应的苹果推送通知服务令牌、设备名称和型号信息，以证明其确实获取了相关数据。并宣称其目的不是针对苹果用户展开攻击，而是为了让苹果用户或是更多人意识到", "正利用这些信息追踪公民动态。", "的推导也并不严密：即使这些数据真的来自", "的电脑，也并不能说明", "就使用了这些信息；这份信息也可能是", "调查某次网络攻击的物证，包括是", "探员的个人行为等。", "OS厂商、应用开发商等纷纷进入黑名单。自由软件运动领袖Richard Stallman则把矛头直指国家和政府，他认为手机可以让国家了解用户的位置，并随时进行跟踪。当他发现移动手机能跟踪携带者的位置后，宁愿牺牲方便也要保护个人隐私和安全。他更为笃定地认为“现代移动电话的实现方式在道德伦理上是不可接受的，因为它们根本就是监视和跟踪设备。”"], "tag": ["手机", "apple", "reference", "技术人", "ios", "网络"], "user": ["antiy_seak"], "title": ["\r\n        2012年9月 《UDID罗生门》\r\n        "]},
{"content": ["花落", "年", "月", "日，美国国家标准与技术研究院（", "）宣布新一代", "算法", "的漫长遴选已经产生结果，经过", "年的时间，", "算法最终摘得正果。这毫无疑问是本月安全业界最重量级的消息。", "的设计团队也值得我们分析和关注。按照", "算法的官方排名，其署名次序为", "、", "、", "和", "。其中，我们对", "并不陌生，他正是", "中选算法", "的两位作者之一。在这四位作者中，", "是意大利人，其他三位都是比利时人。在第三轮与", "竞争的其他四个算法中，", "和", "也分别来自丹麦和瑞士。继", "之后，欧洲大陆再次证明了其在信息安全基础研究方面的实力。", "也具有非常鲜明的“硬件化”色彩。四位作者中三位都来自意法半导体（", "），", "则来自恩智半导体（", "）。这也可以理解，由于", "算法在电子认证领域有比较广泛的应用，因此", "算法的在硬件实现方面的特性，包括复杂度、实现成本和效率等，都将成为非常重要的指标。不知道是否因为海绵结构在硬件实现上有特殊的优势，在", "个备选算法中，另外一个采用了", "的算法", "，也是由硬件厂商日本日立（", "）的研究者提交的。"], "tag": [], "user": ["antiy_seak"], "title": ["\r\n        2012年10月 《SHA-3花落Keccak》\r\n        "]},
{"content": ["——对2006年一次技术报告的反思", "安天实验室 江海客", "温故.2006", "——这是一个充满预言、谶语和诅咒的年代，这是一个人人皆神、诸佛俱死的年代，我自己也曾因某个只言片语的应验，找到先知先觉的感觉，但推敲起来才发觉自己的狂悖。因此，今天我想认真回顾一篇2006年所做的技术报告，进行一场反思。", "    ", "2006年对于整个反病毒的发展来说是一个特殊的年份。病毒从最早的狭义的感染式恶意代码的定义，已经开始成为涵盖了蠕虫、木马的统称，而蠕虫被作为研究和产业热点的关注度也已经开始下降，木马也开始呈现爆炸式的增长趋势。2006年全年产生的恶意代码总量比1986年到2005年这20年间所产生的恶意代码总数还要多。", "2006年9月25日，笔者在武汉大学做了题为《后冷战时代的病毒捕获体制》的报告，其技术关键词为“木马、蜜罐、旁路捕获、未知检测…. ”，报告的观点为“当前木马与AV之间的对抗已经从辨识对抗、查杀对抗进入到体系对抗阶段”， 笔者称之为“‘后冷战’时代”。今天的报告正是从对此的反思开始，因此称其为“温故2006”。", "六年前我们认为：木马数量呈几何级数增长的趋势，而溢出技术、驱动技术、流文件技术及信息伪装技术等众多黑客技术都开始被应用到木马程序编写中。木马的发展对反病毒的挑战表现于：数量失控、黑客技术、伪装技术和专有性应用等。", "该报告得出“木马动摇了反病毒体系的根基”的结论：传统AV技术的根本链路是编制&gt;&gt;流行&gt;&gt;捕获&gt;&gt;处理，而捕获才是AV的根基。AV的机理是以样本满足一定的流行范围或公开发布为基础，立足于后发式的一对一处理。在此情况下，全面捕获已经趋近不可能，分析处理强度已趋近不收敛，必须有全新的思路作补充。", "此前，我们还提交了一份题为《“中国信息安全将崩盘”于木马的结论》的安天内部分析报告。时隔六年，我们的结论是否得到验证呢？", "迷失.2012", "2012，一个让思想者茫然，行动者迷失的年份。", "我们分别选取了2000年10月24日、2006年11月10日、2012年11月27日三个时间节点的恶意代码分类数量统计，用以对比分析恶意代码的发展趋势。为了保证数据的可信度，我们并未采用己方数据，而是采用了消重后的某国际知名厂商的病毒库中的病毒名称列表。", "\r\n图 1 ：选取2000、2006、2012三个时间点的恶意代码累计总量增长示意图", "\r\n图 2：2000、2006、2012三个时间点的恶意代码分类比例构成", "以上数据显示，从2006年到2012年间出现的恶意代码中，比例最大的显然是Trojan。其数量从2006年的8.4万余种增长到2012年的726万余种，而其他类型的恶意代码尽管均有不同程度的增长，但却完全被木马的增长掩盖掉了。那么我们的“木马崩盘”的预言是正确的么？", "确实存在木马数量爆炸式的增长并未得到遏制的事实。但我们不能不面对两个问题：", "第一，信息安全整体崩盘了吗？没有。网银、网游等产业依然在快速成长，用户的安全体验实际上在提升。", "第二，反病毒的根基动摇了吗？同样没有。我们看到的是", "，不但没有崩盘，反而是壮大发展了。", "，这是值得反思的。因此我们是做出了误判，但我们更大的误判还不在这一点，而是我们过度的思索了数量膨胀带来的挑战，却没有展开更辩证的思考，导致没有把握住今天的威胁——没有对类似APT（高级可持续威胁等趋势）给予足够的预判和警惕。Flame、Duqu、Gauss和Stuxnet，它们既不是木马，不是蠕虫，也不是僵尸网络，而是APT。我们最大的失误不是没有遏制昨天的威胁，而是没有有效应对今天的威胁。", "在2006年，我们是否对APT这种现象有所感知呢？答案是“有”。在“后冷战”报告中，我们提出了一个词汇“专有化”，并提出“经济利益化和政治利益化促进木马向定向性、专有化发展；从传统的散步行为向定向行为转化，不需要大面积传播也能达到一定目的”的观点。纵观这些文字，我们如果自吹当年就预测了APT是“自恋+自欺欺人“的，因为APT不是一种木马，不是一类单一的恶意代码，它是一整套的攻击方法和资源体系，而当时我们并没有跳出一个传统反病毒工程师的角度来看待这一问题。", "在2006年那场报告中，我们通过2001、2005年两次反病毒横向检出率对比，展示了木马时代反病毒检出率显著下降的趋势，并以此数据作为恶意代码进入“后冷战”时代的支撑。但面对类似APT等新兴威胁，传统查杀率统计已经失去了意义，安全厂商能力表现的度量衡又是什么呢？", "我们曾经对比2000～2006年若干个流行蠕虫的初始流行时间和厂商感知时间，我们发现虽然其中部分蠕虫出现使安全厂商措手不及，但大部分至少是在24小时内被捕获，有的时间稍长但也是以天来计算。而APT时代，我们对相关恶意代码的感知时间则以年为单位来计算，其中Flame是在初始活动近5年后才被发现的，这是由于投放的定向性、条件触发、自毁等方法导致的攻守不平衡。而另一原因也是境内外能力与信息的不对称，无法得到国外工控等厂商的技术支持。如国内机构在Stuxnet的每一个关键分析节点形成成果的时间都比境外晚一个月到45天左右，其中很多分析点我们都不能独立完成，这里既有投入和水平的因素，也有与境外分析团队信息不对称的原因。", "弯路. 2006～2012", "——误判不是无代价的，误判必然导致错误的导向和行动。分析我们没有有效应对木马时代的原因，或许可以为我们有效应对APT时代提供参考。", " ", "我们从目前的角度回顾当时对木马的理解：作为传统的AVER，不仅没有预判APT的产生，对于木马的认识也存在诸多错误，误判必将导致错误的导向和行动。接下来列举我们在木马时代做出的错误的技术决策，或许能给我们今后有效应对APT时代提供有价值的参考。", "恶意代码的最佳捕获方式是什么？在2006年报告中，我们介绍了捕风计划，即基于低成本ARM架构做成仿真蜜罐（Honeypot）或蜜池（Honeypool）。但事实证明，最佳的捕获点就是用户终端本身，终端覆盖能力越强，捕获能力越强。但传统反病毒更看重更具有可控性的主动捕获方式，因此我们选择了“向左转”，部署了大量这样的蜜罐节点，但效果并不理想。", "在2006年报告中，我们还提出如何应对木马爆炸式增长的思路，即不断提高启发式的敏感性，提交加权值非常低的文件，以采集更多样本。我们自己也清楚，基于可执行对象无条件上报的思路可能是更有效的，但在当时的情况下，我们依然对带宽和计算成本有比较大的焦虑，同时对这种无条件提交的方法，有很强烈的隐私质疑。所以，最终还是采取了提升未知检测能力和敏感性的方法。", "在2006年报告中，我们同时提到基于旁路的恶意代码检测架构，即把一个包检测的体系结构变成一个基于流还原的体系结构，在流还原的体系结构上串接一个异步引擎，来过滤掉多余的文件，实现上报。实际上，从2005年起，已有大量团队陆续投入到基于网页和二进制文件爬虫的研究中，而我们当时尽管在两方面都做了工作，但在还原捕获和检测方面无疑投入更多。", "以上所述的每一个时刻，我们都选择了“向左转”，但实际上正确的道路却在右边。事实上，木马这种爆炸式增长趋势得到了有效的对抗，而正是基于海量终端的无条件上报所构筑出的文件鉴定体系使这种对抗成为可能。这种海量终端云鉴定的能力，取代了传统的分析流水线，成为当前反病毒技术新的核心支撑。传统的基于高质量的特征码，包括高质量启发式检测规则的引擎，如果没有这种技术的辅助支撑，无一不会显得落伍。", "同时，可以说从传统的磁盘时代，从8086 Debug为起点的成长过程中，AV业界的资源一直相对匮乏，并存在诸多局限性。我们也看到传统反病毒工程界的一些原则，确实迫使我们会选择一些高成本、低效果的方案，如基于蜜罐的捕获体系和基于旁路的捕获体系，都是我们想要搭建不对用户和网站产生干扰的环境的体现。当我们认识到“贫瘠的资源局限想象力；狭义的道德感局限策略；传统的惯性局限方法”的时候，我们如何建立新的分析方法来有效应对当前的威胁，并避免下一个误判呢？", "思索.2012～201x", "信息安全没有崩盘的原因，是因为应用跑得更快；应用跑的令人心惊的原因，是应用忘记了带上安全伴跑。向前走并没有错，我们只是没有绕过路上的石头！但我们不能因为会绊到石头拒绝向前！", " ", "表 1 ：2000、2006和2012的三个统计节点的恶意代码分类统计数据", "如果对前文图表所使用的2000、2006和2012的三个统计节点的数据进一步跟踪的话，我们可以做出更多的分析和解读。", "蠕虫的数量增长其实也很快。从2000年的500多种，到2006年的8000多种，再到2012年11月的35万余种。这个数字增长虽然显著，但却被木马数量的剧增所掩盖。蠕虫的膨胀的势头弱于木马，明显与包括Windows系统的安全性提升，漏洞利用的定向性而导致的溢出工具和载荷分离等因素有关。", "而对HackTool（黑客工具）和Spyware（广告件和色情件）来说，其在2006年和2012年的规模竟然都十分接近，从某种意义上来说，它们既有恶意代码的基因，但也是正常应用的近亲，它们的发展速度也正反映了应用成长的速度。由此我们不禁在想，由于木马构造的批量化、以及投放端变换（Poly by Server Side）的趋势，从HASH统计上看，黑白名单的规模可能呈现出一种接近趋势，这会很大程度上重新唤起人们对白名单方法的兴趣。", "\r\n图 3：恶意代码的演进", "而有趣的是，病毒的数量至今没有突破3万种。特别是2006年之后，与其他恶意代码类型相比，增量非常少。很多研究者和爱好者将此都简单的概括为：因为病毒感染需要编写者的水平更高，而蠕虫、木马是一个独立文件，因此编写起来更容易。正是因此我们曾经认为病毒到木马是一种技术退化，但如果我们跳出唯技术观来看，就会得出一种相反的结论：", "，因此被淘汰。操作系统的高度复杂已经为独立恶意代码提供了很好的掩盖，不再需要用片段代码注入到宿主进行攻击为掩护。因此我们认为：", "。而后又从单一的文件载荷，变成包括多文件、驱动和其他内核技术、Rootkit等隐藏技术在内的复杂的节点环境场景；同时，其网络行为也从单点的窃密回传和一对一的C/S控制等，演化为多层控制、甚至无中心P2P\r\n 化的Botnet体制。由此看来，APT所需要的所有技术手段和单点思想在蠕虫、木马时代均已具备，各种攻击方法也均已成熟。在从最早的几百个字节的感染式病毒，发展到今天的APT攻击的整个过程中，", "。", "既然木马时代到APT时代表现出很自然的水到渠成，那么我们为何没有预言APT的发生？我们忽略和关键因素是什么？", "在木马时代的地下经济驱动中，各个国家均是地下经济体系和恶意代码的受害者。其基础规则也基于这一共同点搭建。而", "，而攻击的对象也变成了他国政府和其他对立的政经体系。未能预见到威胁与被威胁者主体的突然变化以及这种变化的驱动影响，才是我们没有正确预判APT的出现的原因。", "我曾对传统恶意代码威胁要素进行了概括：第一，入口，恶意代码如何获得权限；第二，介质，恶意代码如何到达节点；第三，格式，恶意代码如何存储。那么新APT威胁要素是什么呢？APT不是一个简单的恶意代码，而是一个体系，对于这个体系，我们需要思考什么呢？APT之后还会有新的安全威胁形式，那么有没有一个更宏观的视野去分析？", "第一，   ", "。", "大至整个社会安全保障体系，小到主机环境，都是在遏制恶意代码的旧形态发展的。随着主流操作系统安全性的提升，地址随机化，UAC机制等整套的执行保护体系使这种远程溢出和U盘感染变得越来越困难，主动传播也变得越来越困难， URL欺诈等逐步成为主流，所以我们要关注整个产业链的生态和基础发展。", "第二，   ", "。", "在感染式病毒和早期蠕虫活跃的时期，很多人是为了出名而编写病毒和蠕虫，而木马编写多数是利益因素，因此前者往往是个体，后者则形成利益集团。所以在DOS时代，最庞大的感染式恶意代码家族也只有549种，而木马时代，数量最多的木马家族“灰鸽子”变种数超过了27万种。木马之所以如此之多，是因为它们在地下经济体系的驱动下，找到了自身的盈利模式，形成了规模能力。", "第三，   ", "。", "我们要充分考虑到编写恶意代码的成本和攻防双方的成本及需要的资源体系。正是", "2001年，我们对红色代码发布了仅有一页的BBS预警；2003年，我们对口令猜测类蠕虫做了一个13页的关联分析报告；而今年，我们对Flame的分析报告却长达92页，却感觉只分析了冰山一角。有趣的是，我们却从来没有针对任何一个木马发布长篇的系统的报告，这说明对于不同形态安全事件确实存在不同的应对需求。", "在早期感染式病毒为主导的时代，我们面对的是对", "，因此，我们要进行人工分析，编写清除病毒的参数、脚本或模块，把文件恢复到感染前的状态；而对于蠕虫，我们面对的是", "，类似Slammer在不到十分钟的时间就感染了全球百万台SQL Server服务器的等情况，让产业界更关注发现并遏制蠕虫的及时性；而对于木马，我们主要担心其数量级数的膨胀，是一种", "，我们需要增强海量计算资源的自动分析和终端上的主动防御能力与之抗衡；而对于APT，我们却是难以预见和防御的，我们对APT的恐惧是对其", "那么我们应如何有效应对APT？我们所能做的是", "。", "不同的时代，由于威胁对象和方法的不同，引发了需求和焦虑感的不同，进而导致我们工作方法也随之产生相应地变化。", "尾声", "比尔.盖茨说：“五年，这就是我们向前能看到最远的时间。”", "当想到产业巨子都有如此的时间危机，我更不敢判断我能向前看多远。只知道一定比盖茨近得多。我们难以看远未来，却能更多的反思过去，所以我今天的每一句话，都比六年前谨慎的多，因为我希望六年后，能有勇气回顾今天的话。", "(感谢我的同事兰姐、Angel等对此文的贡献)", "作者微博：http://weibo.com/seak", "电子邮件：seak@antiy.com"], "tag": ["反病毒 特洛伊木马 恶意代码的趋势与统计"], "user": ["antiy_seak"], "title": ["\r\n        木马雪崩到APT的关联与必然——对2006年一次技术报告的反思\r\n        "]},
